jj11hh/ch554_sdcc/projects/cdc_nrf24l01_recv/main.c
    }
}

void GPIOSetup( void ) {
    // Pins:
    // LED:     P3.4 Output
    // IRQ:     P3.2 Input & Interrupt
    // MOSI:    P1.5 Output
    // MISO:    P1.6 Input
    // SCK:     P1.7 Output
    // CE:      P3.1 Output
    // CSN:     P3.0 Output

    P3_DIR_PU = 0b11111011;
    P3_MOD_OC = 0b00000000;
    // Port3: 8 7 6 5 4 3 2 1 0
    // In:                0
    // Out:   1 1 1 1 1 1   1 1

    P1_DIR_PU = 0b110111111;
    P1_MOD_OC = 0b000000000;
    // Port1: 8 7 6 5 4 3 2 1 0
    // In:        0
    // Out:   1 1   1 1 1 1 1 1

    LED = 1; // LED Off
    CE = 0;  // Disable TX/RX
    CSN = 1;
    SCK = 0;

    PWM_CTRL = bPWM_IE_END | bPWM_IF_END | bPWM2_POLAR | bPWM2_OUT_EN;
    PWM_DATA2 = 0;
    PWM_CK_SE = 1;
    IE_PWMX = 1;

    IT0 = 1;
    EX0 = 1;

    EA = 1;
}

void USBCDC_SendBytes(const char *buf, uint8_t len) {
    // write upload endpoint
    while (UpPoint2_Busy);
    memcpy(Ep2Buffer + MAX_PACKET_SIZE, buf, len);
    UEP2_T_LEN = len; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

void nRF24_Config( void ){
    nRF24_CE_L();

    nRF24_WriteReg(nRF24_REG_EN_AA, 0x00);
    nRF24_WriteReg(nRF24_REG_EN_RXADDR, 0x01);
    nRF24_WriteReg(nRF24_REG_SETUP_AW, 0b11);
    nRF24_WriteReg(nRF24_REG_SETUP_RETR, 0x00);
    nRF24_WriteReg(nRF24_REG_RF_CH, 40);
    nRF24_WriteReg(nRF24_REG_RF_SETUP, 0b00100011);
    nRF24_CSN_L();
    nRF24_LL_RW(nRF24_CMD_W_REGISTER | nRF24_REG_RX_ADDR_P0);
    nRF24_LL_RW(0x34);
    nRF24_LL_RW(0x43);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x01);
    nRF24_CSN_H();

    nRF24_CSN_L();
    nRF24_LL_RW(nRF24_CMD_W_REGISTER | nRF24_REG_TX_ADDR);
    nRF24_LL_RW(0x34);
    nRF24_LL_RW(0x43);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x10);
    nRF24_LL_RW(0x01);
    nRF24_CSN_H();

    // 接收数据长度 22 bytes
    nRF24_WriteReg(nRF24_REG_RX_PW_P0, 22);

    nRF24_WriteReg(nRF24_REG_CONFIG, 0x0F);

    nRF24_FlushRX();
    nRF24_FlushTX();
    nRF24_ClearIRQFlags();

    mDelaymS(100);
    nRF24_CE_H();
}

volatile uint16_t led_hl_count = 0;

void LEDInterrupt ( void ) __interrupt( INT_NO_PWMX ) {
    if (led_hl_count) {
        PWM_DATA2 = 255;
        led_hl_count --;
    }
    else {
        PWM_DATA2 = 10;
    }
}

bool new_packet = false;
__xdata uint8_t rcv_buf[32];

void IRQ_ISR ( void ) __interrupt( INT_NO_INT0 ) {
    led_hl_count = 65535;
    new_packet = true;
    if (nRF24_GetStatus_RXFIFO() != nRF24_STATUS_RXFIFO_EMPTY){
        nRF24_CE_L();
        nRF24_ReadMBReg(nRF24_CMD_R_RX_PAYLOAD, rcv_buf, 22);
        nRF24_ClearIRQFlags();
        nRF24_CE_H();
    }
}

//主函数
void main( void )
{
    __xdata uint32_t Uart_Timeout = 0;
    __xdata uint8_t recievedData[MAX_PACKET_SIZE] ="";
    uint8_t dataRecievedCopFlag = 0 ; 
    CfgFsys( );                                                           // CH559 clock selection configuration
    mDelaymS(5);                                                          // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
    mInitSTDIO( );                                                        // Serial port 0, can be used for debugging
    GPIOSetup();
    nRF24_Config();

#ifdef DE_PRINTF
    printf("start ...\n");
#endif
    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

    while(1)
    {
        if (new_packet) {
            new_packet = false;
            USBCDC_SendBytes(rcv_buf, 22);
        }
    }
}
